emacs/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-27 Wed 20:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="author" content="John Szaniszlo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd827338">1. Basic Settings</a>
<ul>
<li><a href="#org79a1d4b">1.1. Init files at various init points</a></li>
<li><a href="#orged961e8">1.2. System</a>
<ul>
<li><a href="#org4bd7086">1.2.1. Debugging</a></li>
<li><a href="#orgb879edc">1.2.2. Ensure all packages are installed by default</a></li>
<li><a href="#orgf77fccb">1.2.3. Use :demand for all packages when in daemon mode</a></li>
<li><a href="#org4d1ea05">1.2.4. Native Compilation</a></li>
<li><a href="#orgbd29283">1.2.5. Display startup time</a></li>
<li><a href="#orgb83a6c5">1.2.6. <code>PATH</code></a></li>
</ul>
</li>
<li><a href="#org5666652">1.3. Reduce clutter</a></li>
<li><a href="#orgbe2bdc4">1.4. Activate <code>recentf</code>, <code>savehist</code>, <code>saveplace</code>, and <code>auto-revert</code></a></li>
<li><a href="#org7c69ab9">1.5. dir-config.el for Local configs</a></li>
</ul>
</li>
<li><a href="#org461e12b">2. Look and Feel</a>
<ul>
<li><a href="#orge477b3e">2.1. ultra-scroll</a></li>
<li><a href="#org1edcbbf">2.2. Theming</a>
<ul>
<li><a href="#org5c2d436">2.2.1. the wonderful kanagawa themes</a></li>
<li><a href="#org74f42b9">2.2.2. auto switch between light and dark modes</a></li>
</ul>
</li>
<li><a href="#org5f253c1">2.3. Fonts</a>
<ul>
<li><a href="#org51d6b6c">2.3.1. Font bootstrapping</a></li>
<li><a href="#orgc86a78a">2.3.2. Mixed pitch</a></li>
</ul>
</li>
<li><a href="#org8e06500">2.4. Highlight Comment Annotations</a></li>
<li><a href="#org55037ba">2.5. Keep window sizes reasonable</a></li>
<li><a href="#org8f2cb5a">2.6. Cursor settings</a>
<ul>
<li><a href="#orgc2f0bc9">2.6.1. Adaptive cursor width</a></li>
<li><a href="#orgf679181">2.6.2. Box cursor</a></li>
</ul>
</li>
<li><a href="#org90d7f26">2.7. Line numbers</a></li>
<li><a href="#orgf26f3c7">2.8. Text wrapping</a></li>
<li><a href="#orgc746a06">2.9. Highlight line</a></li>
<li><a href="#org2a7cd7c">2.10. Underlines</a></li>
</ul>
</li>
<li><a href="#org1a720b6">3. Interface</a>
<ul>
<li><a href="#orga1c6559">3.1. Use ibuffer instead of list-buffers</a></li>
<li><a href="#org0a41685">3.2. Always use <code>y</code> and <code>n</code> as answers.</a></li>
<li><a href="#org70cafd4">3.3. Make C-g a bit more helpful</a></li>
<li><a href="#org58a15e5">3.4. Which-Key</a></li>
<li><a href="#org782aa5b">3.5. Interactive Do</a></li>
<li><a href="#org10fcdec">3.6. Org-mode customizations</a>
<ul>
<li><a href="#org3467d6a">3.6.1. Setup and bindings</a></li>
<li><a href="#orge0794bc">3.6.2. Distraction free writing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6254290">4. Development/Workspace</a>
<ul>
<li><a href="#orgd5e1833">4.1. Magit</a>
<ul>
<li><a href="#org8aea174">4.1.1. Usage and configs</a></li>
<li><a href="#org7a6895e">4.1.2. MacOS speedup</a></li>
<li><a href="#orgb7fd166">4.1.3. Highlight diffs in files</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdd3e3ee">5. Other</a>
<ul>
<li><a href="#org9352bf7">5.1. Reload Init</a></li>
</ul>
</li>
<li><a href="#orgce9c22c">6. tangle post-init.el on save</a></li>
</ul>
</div>
</div>
<p>
Based on the <a href="https://github.com/jamescherti/minimal-emacs.d/">minimal-emacs.d</a> project by James Cherti.
</p>
<div id="outline-container-orgd827338" class="outline-2">
<h2 id="orgd827338"><span class="section-number-2">1.</span> Basic Settings</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org79a1d4b" class="outline-3">
<h3 id="org79a1d4b"><span class="section-number-3">1.1.</span> Init files at various init points</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Prevent config files from being byte-compiled and to activate lexical binding as <a href="https://github.com/jamescherti/minimal-emacs.d?tab=readme-ov-file#customizations-never-modify-initel-and-early-initel-modify-these-instead">required by minimal-emacs.d</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; pre-early-init.el --- DESCRIPTION -*- no-byte-compile: t; lexical-binding: t; -*-
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; post-early-init.el --- DESCRIPTION -*- no-byte-compile: t; lexical-binding: t; -*-
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; post-init.el --- DESCRIPTION -*- no-byte-compile: t; lexical-binding: t; -*-
</pre>
</div>
</div>
</div>
<div id="outline-container-orged961e8" class="outline-3">
<h3 id="orged961e8"><span class="section-number-3">1.2.</span> System</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4bd7086" class="outline-4">
<h4 id="org4bd7086"><span class="section-number-4">1.2.1.</span> Debugging</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar minimal-emacs-debug nil
  "Non-nil to enable debug.")
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb879edc" class="outline-4">
<h4 id="orgb879edc"><span class="section-number-4">1.2.2.</span> Ensure all packages are installed by default</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq use-package-always-ensure t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf77fccb" class="outline-4">
<h4 id="orgf77fccb"><span class="section-number-4">1.2.3.</span> Use :demand for all packages when in daemon mode</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(if (daemonp)
    (setq use-package-always-demand t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d1ea05" class="outline-4">
<h4 id="org4d1ea05"><span class="section-number-4">1.2.4.</span> Native Compilation</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">
<pre class="src src-elisp">(use-package compile-angel
 :ensure t
 :custom
 (compile-angel-verbose t)

 :config
 (push "/init.el" compile-angel-excluded-files)
 (push "/early-init.el" compile-angel-excluded-files)
 (push "/pre-init.el" compile-angel-excluded-files)
 (push "/post-init.el" compile-angel-excluded-files)
 (push "/pre-early-init.el" compile-angel-excluded-files)
 (push "/post-early-init.el" compile-angel-excluded-files)

 (compile-angel-on-load-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd29283" class="outline-4">
<h4 id="orgbd29283"><span class="section-number-4">1.2.5.</span> Display startup time</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Report the startup duration and the number of garbage collections that occurred during initialization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun display-startup-time ()
  "Display the startup time and number of garbage collections."
  (message "Emacs init loaded in %.2f seconds (Full emacs-startup: %.2fs) with %d garbage collections."
           (float-time (time-subtract after-init-time before-init-time))
           (time-to-seconds (time-since before-init-time))
           gcs-done))

(add-hook 'emacs-startup-hook #'display-startup-time 100)
</pre>
</div>
</div>
</div>
