emacs/post-init.el
;;; post-init.el --- DESCRIPTION -*- no-byte-compile: t; lexical-binding: t; -*-

(setq use-package-always-ensure t)

(if (daemonp)
    (setq use-package-always-demand t))

(use-package compile-angel
 :ensure t
 :custom
 (compile-angel-verbose t)

 :config
 (push "/init.el" compile-angel-excluded-files)
 (push "/early-init.el" compile-angel-excluded-files)
 (push "/pre-init.el" compile-angel-excluded-files)
 (push "/post-init.el" compile-angel-excluded-files)
 (push "/pre-early-init.el" compile-angel-excluded-files)
 (push "/post-early-init.el" compile-angel-excluded-files)

 (compile-angel-on-load-mode 1))
