emacs/config.html
<div id="outline-container-orgb83a6c5" class="outline-4">
<h4 id="orgb83a6c5"><span class="section-number-4">1.2.6.</span> <code>PATH</code></h4>
<div class="outline-text-4" id="text-1-2-6">
</div>
<ol class="org-ol">
<li><a id="orgc77082a"></a>MacOS specific path fix for libgccjit<br />
<div class="outline-text-5" id="text-1-2-6-1">
<p>
Fix for <a href="https://github.com/d12frosted/homebrew-emacs-plus/issues/733">libgccjit.so error invoking gcc driver</a> on MacOS homebrew installations
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun homebrew-gcc-paths ()
  "Return GCC library paths from Homebrew installations.
Detects paths for gcc and libgccjit packages to be used in LIBRARY_PATH."
  (let* ((paths '())
         (brew-bin (or (executable-find "brew")
                       (let ((arm-path "/opt/homebrew/bin/brew")
                             (intel-path "/usr/local/bin/brew"))
                         (cond
                          ((file-exists-p arm-path) arm-path)
                          ((file-exists-p intel-path) intel-path))))))

    (when brew-bin
      ;; Get gcc paths.
      (let* ((gcc-prefix (string-trim
                          (shell-command-to-string
                           (concat brew-bin " --prefix gcc"))))
             (gcc-lib-current (expand-file-name "lib/gcc/current" gcc-prefix)))
        (push gcc-lib-current paths)

        ;; Find apple-darwin directory.
        (let* ((default-directory gcc-lib-current)
               (arch-dirs (file-expand-wildcards "gcc/*-apple-darwin*/*[0-9]")))
          (when arch-dirs
            (push (expand-file-name
                   (car (sort arch-dirs #'string&gt;)))
                  paths))))

      ;; Get libgccjit paths
      (let* ((jit-prefix (string-trim
                          (shell-command-to-string
                           (concat brew-bin " --prefix libgccjit"))))
             (jit-lib-current (expand-file-name "lib/gcc/current" jit-prefix)))
        (push jit-lib-current paths)))

    (nreverse paths)))

(defun setup-macos-native-comp-library-paths ()
  "Set up LIBRARY_PATH for native compilation on macOS.
Includes Homebrew GCC paths and CommandLineTools SDK libraries."
  (let* ((existing-paths (split-string (or (getenv "LIBRARY_PATH") "") ":" t))
         (gcc-paths (homebrew-gcc-paths))
         (clt-paths '("/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
         (unique-paths (delete-dups
                        (append existing-paths gcc-paths clt-paths))))

    (setenv "LIBRARY_PATH" (mapconcat #'identity unique-paths ":"))))

;; Set up library paths for native compilation on macOS.
(when (eq system-type 'darwin)
  (setup-macos-native-comp-library-paths))
</pre>
</div>
</div>
</li>
<li><a id="org3dc2db6"></a>Add system path to emacs exec-path<br />
<div class="outline-text-5" id="text-1-2-6-2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package exec-path-from-shell
  :init
  :hook
  (after-init . exec-path-from-shell-initialize))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org5666652" class="outline-3">
<h3 id="org5666652"><span class="section-number-3">1.3.</span> Reduce clutter</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Keep <code>~/.emacs.d/</code> clean using the <a href="https://github.com/emacscollective/no-littering"><code>no-littering</code></a> package.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package no-littering
  :config
  (no-littering-theme-backups))
</pre>
</div>

<p>
Use a dedicated file for Emacs customizations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file 'noerror)
</pre>
</div>

<p>
Move native compilation cache into <code>/var</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(when (and (fboundp 'startup-redirect-eln-cache)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (startup-redirect-eln-cache
   (convert-standard-filename
    (expand-file-name  "var/eln-cache/" user-emacs-directory))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe2bdc4" class="outline-3">
<h3 id="orgbe2bdc4"><span class="section-number-3">1.4.</span> Activate <code>recentf</code>, <code>savehist</code>, <code>saveplace</code>, and <code>auto-revert</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
This code activate preconfigured packages by <code>minimal-emacs.d</code> <code>init.el</code>. (<a href="https://github.com/jamescherti/minimal-emacs.d?tab=readme-ov-file#how-to-activate-recentf-savehist-saveplace-and-auto-revert">source</a>)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook #'global-auto-revert-mode)
(add-hook 'after-init-hook #'recentf-mode)
(add-hook 'after-init-hook #'savehist-mode)
(add-hook 'after-init-hook #'save-place-mode)
</pre>
</div>

<p>
Ignore the <code>no-littering</code> var files from <code>recentf</code>, but only after the package has been loaded.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'recentf-mode-hook
          (lambda ()
            (add-to-list 'recentf-exclude
                         (recentf-expand-file-name no-littering-var-directory))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c69ab9" class="outline-3">
<h3 id="org7c69ab9"><span class="section-number-3">1.5.</span> dir-config.el for Local configs</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-elisp">(use-package dir-config
  :custom
  (dir-config-file-names '(".dir-config.el"))
  (dir-config-allowed-directories '("~/Development" "~/Documents"))
  :config
  (dir-config-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org461e12b" class="outline-2">
<h2 id="org461e12b"><span class="section-number-2">2.</span> Look and Feel</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge477b3e" class="outline-3">
<h3 id="orge477b3e"><span class="section-number-3">2.1.</span> ultra-scroll</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://github.com/jdtsmith/ultra-scroll">Scroll emacs like lightning</a> ⚡🖱️⚡
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package ultra-scroll
  :vc (:url "https://github.com/jdtsmith/ultra-scroll" :branch "main")
  :init
  (setq scroll-conservatively 101 ; important!
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1edcbbf" class="outline-3">
<h3 id="org1edcbbf"><span class="section-number-3">2.2.</span> Theming</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org5c2d436" class="outline-4">
<h4 id="org5c2d436"><span class="section-number-4">2.2.1.</span> the wonderful kanagawa themes</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The excellent <a href="https://github.com/rebelot/kanagawa.nvim">kanagawa.nvim</a> theme ported to emacs.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package kanagawa-themes
  :config
  (load-theme 'kanagawa-wave))
</pre>
</div>
</div>
</div>
<div id="outline-container-org74f42b9" class="outline-4">
<h4 id="org74f42b9"><span class="section-number-4">2.2.2.</span> auto switch between light and dark modes</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package auto-dark
  :custom
  (auto-dark-themes '((kanagawa-wave) (kanagawa-lotus)))
  :init
  (auto-dark-mode))
</pre>
</div>
</div>
</div>
</div>
