emacs/post-init.el

(use-package exec-path-from-shell
  :init
  :hook
  (after-init . exec-path-from-shell-initialize))

(use-package no-littering
  :config
  (no-littering-theme-backups))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file 'noerror)

(add-hook 'after-init-hook #'global-auto-revert-mode)
(add-hook 'after-init-hook #'recentf-mode)
(add-hook 'after-init-hook #'savehist-mode)
(add-hook 'after-init-hook #'save-place-mode)

(add-hook 'recentf-mode-hook
          (lambda ()
            (add-to-list 'recentf-exclude
                         (recentf-expand-file-name no-littering-var-directory))))

(use-package dir-config
  :custom
  (dir-config-file-names '(".dir-config.el"))
  (dir-config-allowed-directories '("~/Development" "~/Documents"))
  :config
  (dir-config-mode))

(use-package ultra-scroll
  :vc (:url "https://github.com/jdtsmith/ultra-scroll" :branch "main")
  :init
  (setq scroll-conservatively 101 ; important!
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))

(use-package kanagawa-themes
  :config
  (load-theme 'kanagawa-wave))

(use-package auto-dark
  :custom
  (auto-dark-themes '((kanagawa-wave) (kanagawa-lotus)))
  :init
  (auto-dark-mode))
