emacs/config.html
<div id="outline-container-org5f253c1" class="outline-3">
<h3 id="org5f253c1"><span class="section-number-3">2.3.</span> Fonts</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org51d6b6c" class="outline-4">
<h4 id="org51d6b6c"><span class="section-number-4">2.3.1.</span> Font bootstrapping</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-elisp">  (defun jj/setup-font-faces ()
  "Setup all font faces."
  (when (display-graphic-p)
    (let ((mono-spaced "VictorMono Nerd Font")
          (prop-spaced "iA Writer Duo S"))
      (set-face-attribute 'default nil :family mono-spaced :height 190)
      (set-face-attribute 'fixed-pitch nil :family mono-spaced :height 1.0)
      (set-face-attribute 'variable-pitch nil :family prop-spaced :height 0.8))
    (with-eval-after-load 'org
      (dolist (face '((org-level-1 . 1.3)
                      (org-level-2 . 1.25)
                      (org-level-3 . 1.20)
                      (org-level-4 . 1.15)
                      (org-level-5 . 1.10)
                      (org-level-6 . 1.05)
                      (org-level-7 . 1.0)
                      (org-level-8 . 1.0)))
        (set-face-attribute (car face) nil :font "iA Writer Duo S" :weight 'regular :height (cdr face))
        )
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
      )
    )
  )
(add-hook 'after-init-hook 'jj/setup-font-faces)
(add-hook 'server-after-make-frame-hook 'jj/setup-font-faces)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc86a78a" class="outline-4">
<h4 id="orgc86a78a"><span class="section-number-4">2.3.2.</span> Mixed pitch</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package mixed-pitch
  :hook
  (text-mode . mixed-pitch-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e06500" class="outline-3">
<h3 id="org8e06500"><span class="section-number-3">2.4.</span> Highlight Comment Annotations</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-elisp">(defun fx/highlight-todo-keywords ()
  "Add custom keywords for highlighting TODOs and similar annotations."
  (font-lock-add-keywords nil '(("\\&lt;\\(TODO\\|FIXME\\|BUG\\|HACK\\|NOTE\\|REVIEW\\|DEPRECATED\\):" 1 font-lock-warning-face t))))
(add-hook 'prog-mode-hook 'fx/highlight-todo-keywords)
</pre>
</div>
</div>
</div>
<div id="outline-container-org55037ba" class="outline-3">
<h3 id="org55037ba"><span class="section-number-3">2.5.</span> Keep window sizes reasonable</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-elisp">(use-package golden-ratio
  :diminish golden-ratio-mode
  :init
  (golden-ratio-mode 1)
  :custom
  (golden-ratio-auto-scale t))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f2cb5a" class="outline-3">
<h3 id="org8f2cb5a"><span class="section-number-3">2.6.</span> Cursor settings</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgc2f0bc9" class="outline-4">
<h4 id="orgc2f0bc9"><span class="section-number-4">2.6.1.</span> Adaptive cursor width</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
<a href="https://pragmaticemacs.wordpress.com/2017/10/01/adaptive-cursor-width/">Adaptive cursor width</a>: make cursor the width of the character it is under. i.e. full width of a TAB.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setq x-stretch-cursor t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf679181" class="outline-4">
<h4 id="orgf679181"><span class="section-number-4">2.6.2.</span> Box cursor</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package emacs
  :commands jj/cursor-type-mode
  :config
  (setq-default cursor-type 'box)
  (setq-default cursor-in-non-selected-windows '(bar . 2))
  (setq-default blink-cursor-blinks 50)
  (setq-default blink-cursor-interval 0.75)
  (setq-default blink-cursor-delay 0.2)

  (blink-cursor-mode -1)

  (define-minor-mode jj/cursor-type-mode
    "Toggle between static block and pulsing bar cursor."
    :init-value nil
    :global t
    (if prot/cursor-type-mode
        (progn
          (setq-local blink-cursor-interval 0.75
                      cursor-type '(bar . 2)
                      cursor-in-non-selected-windows 'hollow)
          (blink-cursor-mode 1))
      (dolist (local '(blink-cursor-interval
                       cursor-type
                       cursor-in-non-selected-windows))
        (kill-local-variable `,local))
      (blink-cursor-mode -1))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org90d7f26" class="outline-3">
<h3 id="org90d7f26"><span class="section-number-3">2.7.</span> Line numbers</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Display line numbers in programming mode.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setopt display-line-numbers-width 3)           ; Set a minimum width
(setopt display-line-numbers-type 'relative)    ; Relative line numbers
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf26f3c7" class="outline-3">
<h3 id="orgf26f3c7"><span class="section-number-3">2.8.</span> Text wrapping</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Nice line wrapping when working with text. (Bedrock Emacs)
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'text-mode-hook 'visual-line-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc746a06" class="outline-3">
<h3 id="orgc746a06"><span class="section-number-3">2.9.</span> Highlight line</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Modes to highlight the current line with.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(let ((hl-line-hooks '(text-mode-hook prog-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2a7cd7c" class="outline-3">
<h3 id="org2a7cd7c"><span class="section-number-3">2.10.</span> Underlines</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Prettier underlines from Bedrock Emacs
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setopt x-underline-at-descent-line nil)
</pre>
</div>

<p>
By default, do underline trailing spaces from Bedrock Emacs
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setopt show-trailing-whitespace t)
</pre>
</div>
</div>
</div>
</div>
