emacs/post-init.el

(defun jj/setup-font-faces ()
  "Setup all font faces."
  (when (display-graphic-p)
    (let ((mono-spaced "VictorMono Nerd Font")
          (prop-spaced "iA Writer Duo S"))
      (set-face-attribute 'default nil :family mono-spaced :height 190)
      (set-face-attribute 'fixed-pitch nil :family mono-spaced :height 1.0)
      (set-face-attribute 'variable-pitch nil :family prop-spaced :height 0.8))
    (with-eval-after-load 'org
      (dolist (face '((org-level-1 . 1.3)
                      (org-level-2 . 1.25)
                      (org-level-3 . 1.20)
                      (org-level-4 . 1.15)
                      (org-level-5 . 1.10)
                      (org-level-6 . 1.05)
                      (org-level-7 . 1.0)
                      (org-level-8 . 1.0)))
        (set-face-attribute (car face) nil :font "iA Writer Duo S" :weight 'regular :height (cdr face))
        )
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
      )
    )
  )
(add-hook 'after-init-hook 'jj/setup-font-faces)
(add-hook 'server-after-make-frame-hook 'jj/setup-font-faces)

(use-package mixed-pitch
  :hook
  (text-mode . mixed-pitch-mode))

(defun fx/highlight-todo-keywords ()
  "Add custom keywords for highlighting TODOs and similar annotations."
  (font-lock-add-keywords nil '(("\\<\\(TODO\\|FIXME\\|BUG\\|HACK\\|NOTE\\|REVIEW\\|DEPRECATED\\):" 1 font-lock-warning-face t))))
(add-hook 'prog-mode-hook 'fx/highlight-todo-keywords)

(use-package golden-ratio
  :diminish golden-ratio-mode
  :init
  (golden-ratio-mode 1)
  :custom
  (golden-ratio-auto-scale t))

(setq x-stretch-cursor t)

(use-package emacs
  :commands jj/cursor-type-mode
  :config
  (setq-default cursor-type 'box)
  (setq-default cursor-in-non-selected-windows '(bar . 2))
  (setq-default blink-cursor-blinks 50)
  (setq-default blink-cursor-interval 0.75)
  (setq-default blink-cursor-delay 0.2)

  (blink-cursor-mode -1)

  (define-minor-mode jj/cursor-type-mode
    "Toggle between static block and pulsing bar cursor."
    :init-value nil
    :global t
    (if prot/cursor-type-mode
        (progn
          (setq-local blink-cursor-interval 0.75
                      cursor-type '(bar . 2)
                      cursor-in-non-selected-windows 'hollow)
          (blink-cursor-mode 1))
      (dolist (local '(blink-cursor-interval
                       cursor-type
                       cursor-in-non-selected-windows))
        (kill-local-variable `,local))
      (blink-cursor-mode -1))))

(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setopt display-line-numbers-width 3)           ; Set a minimum width
(setopt display-line-numbers-type 'relative)    ; Relative line numbers

(add-hook 'text-mode-hook 'visual-line-mode)

(let ((hl-line-hooks '(text-mode-hook prog-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))

(setopt x-underline-at-descent-line nil)

(setopt show-trailing-whitespace t)
