emacs/config.org
** Use ibuffer instead of list-buffers

~ibuffer~ is ~list-buffers~'s bigger brother from Mastering Emacs.

#+begin_src elisp :tangle post-init.el
  (global-set-key [remap list-buffers] 'ibuffer)
#+end_src

** Always use ~y~ and ~n~ as answers.

~yes-or-no-p~ will use ~y-or-n-p~. No more typing ~yes~.

#+begin_src elisp :tangle post-init.el
  (setopt use-short-answers t)
#+end_src

** Make C-g a bit more helpful

Copied from Prot's [[https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/#h:1e468b2a-9bee-4571-8454-e3f5462d9321][basic and capable configuration]].

#+begin_src elisp :tangle post-init.el
  (defun prot/keyboard-quit-dwim ()
    "Do-What-I-Mean behaviour for a general `keyboard-quit'.

  The generic `keyboard-quit' does not do the expected thing when
  the minibuffer is open.  Whereas we want it to close the
  minibuffer, even without explicitly focusing it.

  The DWIM behaviour of this command is as follows:

  - When the region is active, disable it.
  - When a minibuffer is open, but not focused, close the minibuffer.
  - When the Completions buffer is selected, close it.
  - In every other case use the regular `keyboard-quit'."
    (interactive)
    (cond
     ((region-active-p)
      (keyboard-quit))
     ((derived-mode-p 'completion-list-mode)
      (delete-completion-window))
     ((> (minibuffer-depth) 0)
      (abort-recursive-edit))
     (t
      (keyboard-quit))))

  (global-set-key [remap keyboard-quit] 'prot/keyboard-quit-dwim)
#+end_src

** Which-Key

Show a popup of available keybindings when typing a key sequence.

#+begin_src elisp :tangle post-init.el
  (use-package which-key
    :config
    (which-key-mode))
#+end_src

** Interactive Do

Enable ido-mode

#+begin_src elisp :tangle post-init.el
(setq ido-enable-flex-matching t)
(setq ido-doeverywhere t)
(ido-mode 1)
#+end_src

** Org-mode customizations
*** Setup and bindings

#+begin_src elisp :tangle post-init.el
  (use-package org
    :ensure t
    :commands (org-mode org-version)
    :mode
    ("\\.org\\'" . org-mode)
    :custom
    (org-startup-truncated t)
    (org-agenda-files (list "~/Documents/Org/agenda.org"))
    (org-export-backends '(md))
    :bind (("C-c a" . org-agenda)
           ("C-c l" . org-store-link)
           ("C-c b" . org-iswitchb)))
#+end_src

*** Distraction free writing

#+begin_src elisp :tangle post-init.el
  (use-package darkroom
    :bind ("C-c d r" . darkroom-tentative-mode))
#+end_src

*** Org Babel

#+begin_src elisp :tangle post-init.el
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (setq org-babel-python-command "python3")
#+end_src

* Development/Workspace
** Magit
*** Usage and configs
Enable and use the excellent magit

#+begin_src elisp :tangle post-init.el
  (use-package magit
    :bind (("C-c m s" . magit-status))
    :custom
    ;; Improve readability of diffs
    (magit-diff-refine-hunk 'all))
#+end_src

*** MacOS speedup
Speed up magit on macos

#+begin_src elisp :tangle post-init.el
  (use-package magit
    :if (eq system-type 'darwin)
    :custom
    (magit-git-executable "/opt/homebrew/bin/git"))
#+end_src

*** Highlight diffs in files

#+begin_src elisp :tangle post-init.el
  (use-package diff-hl
    :hook ((prog-mode . diff-hl-mode)
           (prog-mode . diff-hl-flydiff-mode)))
#+end_src

*** Language Modes
**** Odin-lang Mode

#+begin_src elisp :tangle post-init.el
  (unless (package-installed-p 'odin-mode)
    (package-vc-install "https://git.sr.ht/~mgmarlow/odin-mode"))
  (use-package odin-mode
    :bind (:map odin-mode-map
  	      ("C-c C-r" . 'odin-run-project)
  	      ("C-c C-c" . 'odin-build-project)
  	      ("C-c C-t" . 'odin-test-project)))
#+end_src

* Other
** Reload Init

Helper to reload init file

#+begin_src elisp :tangle post-init.el
  (defun reload-init-file ()
    "Reload the user's init file."
    (interactive)
    (load-file user-init-file)
    (keychain-refresh-environment))
#+end_src

#+begin_src elisp
  (native-comp-available-p)
#+end_src

* tangle post-init.el on save
;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil 'make-it-local)
;; End:
