emacs/config.html
<div id="outline-container-org1a720b6" class="outline-2">
<h2 id="org1a720b6"><span class="section-number-2">3.</span> Interface</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga1c6559" class="outline-3">
<h3 id="orga1c6559"><span class="section-number-3">3.1.</span> Use ibuffer instead of list-buffers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>ibuffer</code> is <code>list-buffers</code>'s bigger brother from Mastering Emacs.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(global-set-key [remap list-buffers] 'ibuffer)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a41685" class="outline-3">
<h3 id="org0a41685"><span class="section-number-3">3.2.</span> Always use <code>y</code> and <code>n</code> as answers.</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>yes-or-no-p</code> will use <code>y-or-n-p</code>. No more typing <code>yes</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setopt use-short-answers t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org70cafd4" class="outline-3">
<h3 id="org70cafd4"><span class="section-number-3">3.3.</span> Make C-g a bit more helpful</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Copied from Prot's <a href="https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/#h:1e468b2a-9bee-4571-8454-e3f5462d9321">basic and capable configuration</a>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun prot/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((&gt; (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(global-set-key [remap keyboard-quit] 'prot/keyboard-quit-dwim)
</pre>
</div>
</div>
</div>
<div id="outline-container-org58a15e5" class="outline-3">
<h3 id="org58a15e5"><span class="section-number-3">3.4.</span> Which-Key</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Show a popup of available keybindings when typing a key sequence.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package which-key
  :config
  (which-key-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org782aa5b" class="outline-3">
<h3 id="org782aa5b"><span class="section-number-3">3.5.</span> Interactive Do</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Enable ido-mode
</p>

<p>
#+begin<sub>src</sub> elisp :tangle post-init.el
(setq ido-enable-flex-matching t)
(setq ido-doeverywhere t)
(ido-mode 1)
</p>
</div>
</div>
<div id="outline-container-org10fcdec" class="outline-3">
<h3 id="org10fcdec"><span class="section-number-3">3.6.</span> Org-mode customizations</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-org3467d6a" class="outline-4">
<h4 id="org3467d6a"><span class="section-number-4">3.6.1.</span> Setup and bindings</h4>
<div class="outline-text-4" id="text-3-6-1">
<div class="org-src-container">
<pre class="src src-elisp">(use-package org
  :ensure t
  :commands (org-mode org-version)
  :mode
  ("\\.org\\'" . org-mode)
  :custom
  (org-startup-truncated t)
  (org-agenda-files (list "~/Documents/Org/agenda.org"))
  (org-export-backends '(md))
  :bind (("C-c a" . org-agenda)
         ("C-c l" . org-store-link)
         ("C-c b" . org-iswitchb)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0794bc" class="outline-4">
<h4 id="orge0794bc"><span class="section-number-4">3.6.2.</span> Distraction free writing</h4>
<div class="outline-text-4" id="text-3-6-2">
<div class="org-src-container">
<pre class="src src-elisp">(use-package darkroom
  :bind ("C-c d r" . darkroom-tentative-mode))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org6254290" class="outline-2">
<h2 id="org6254290"><span class="section-number-2">4.</span> Development/Workspace</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd5e1833" class="outline-3">
<h3 id="orgd5e1833"><span class="section-number-3">4.1.</span> Magit</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org8aea174" class="outline-4">
<h4 id="org8aea174"><span class="section-number-4">4.1.1.</span> Usage and configs</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Enable and use the excellent magit
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package magit
  :bind (("C-c m s" . magit-status))
  :custom
  ;; Improve readability of diffs
  (magit-diff-refine-hunk 'all))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a6895e" class="outline-4">
<h4 id="org7a6895e"><span class="section-number-4">4.1.2.</span> MacOS speedup</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Speed up magit on macos
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package magit
  :if (eq system-type 'darwin)
  :custom
  (magit-git-executable "/opt/homebrew/bin/git"))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7fd166" class="outline-4">
<h4 id="orgb7fd166"><span class="section-number-4">4.1.3.</span> Highlight diffs in files</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-elisp">(use-package diff-hl
  :hook ((prog-mode . diff-hl-mode)
         (prog-mode . diff-hl-flydiff-mode)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdd3e3ee" class="outline-2">
<h2 id="orgdd3e3ee"><span class="section-number-2">5.</span> Other</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9352bf7" class="outline-3">
<h3 id="org9352bf7"><span class="section-number-3">5.1.</span> Reload Init</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Helper to reload init file
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun reload-init-file ()
  "Reload the user's init file."
  (interactive)
  (load-file user-init-file)
  (keychain-refresh-environment))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(native-comp-available-p)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgce9c22c" class="outline-2">
<h2 id="orgce9c22c"><span class="section-number-2">6.</span> tangle post-init.el on save</h2>
<div class="outline-text-2" id="text-6">
<p>
;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) nil 'make-it-local)
;; End:
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Szaniszlo</p>
<p class="date">Created: 2025-08-27 Wed 20:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
