emacs/post-init.el

(global-set-key [remap list-buffers] 'ibuffer)

(setopt use-short-answers t)

(defun prot/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(global-set-key [remap keyboard-quit] 'prot/keyboard-quit-dwim)

(use-package which-key
  :config
  (which-key-mode))

(setq ido-enable-flex-matching t)
(setq ido-doeverywhere t)
(ido-mode 1)

(use-package org
  :ensure t
  :commands (org-mode org-version)
  :mode
  ("\\.org\\'" . org-mode)
  :custom
  (org-startup-truncated t)
  (org-agenda-files (list "~/Documents/Org/agenda.org"))
  (org-export-backends '(md))
  :bind (("C-c a" . org-agenda)
         ("C-c l" . org-store-link)
         ("C-c b" . org-iswitchb)))

(use-package darkroom
  :bind ("C-c d r" . darkroom-tentative-mode))

(use-package magit
  :bind (("C-c m s" . magit-status))
  :custom
  ;; Improve readability of diffs
  (magit-diff-refine-hunk 'all))

(use-package magit
  :if (eq system-type 'darwin)
  :custom
  (magit-git-executable "/opt/homebrew/bin/git"))

(use-package diff-hl
  :hook ((prog-mode . diff-hl-mode)
         (prog-mode . diff-hl-flydiff-mode)))

(unless (package-installed-p 'odin-mode)
  (package-vc-install "https://git.sr.ht/~mgmarlow/odin-mode"))
(use-package odin-mode
  :bind (:map odin-mode-map
	      ("C-c C-r" . 'odin-run-project)
	      ("C-c C-c" . 'odin-build-project)
	      ("C-c C-t" . 'odin-test-project)))

(defun reload-init-file ()
  "Reload the user's init file."
  (interactive)
  (load-file user-init-file)
  (keychain-refresh-environment))
